#+SETUPFILE: ~/.emacs.d/org-templates/base.org
#+TITLE:  Projet : partition d'entiers avec R
#+Author: Arnaud Malapert
#+Email: 
#+DESCRIPTION: Projet de programmation R.
#+KEYWORDS:    computer science, teaching, programming, GNU R.
#+HTML_LINK_HOME: ../introR.html
#+LANGUAGE: fr
#+PROPERTY: header-args :results output :exports both
** Note Finale (/20)
   
   Le calcul de votre note finale sur 20 est open source !
    #+begin_src R :var teams=teams :exports code :results value :session part 
      ## teams est le tableau détaillé d'évaluation
      ## On calcule la note sur 20 sans les bonus
      exclude <- colnames(teams) %in% c("Equipe", "etu1", "etu2", "etu3", "Note.20", "B", "M")
      x <- teams[,!exclude]
      x [ is.na(x) ] <- 0
      x <- rowSums(x)
      ## L'évaluation est sur 31 points
      x <- round((40 * x)/31, 0)/2
      ## On ajoute les bonus/malus
      y <- teams[,c("B", "M")]
      y [ is.na(y) ] <- 0
      x <- x + rowSums(y)
      ## On affiche les résultats
      y <- order(x, decreasing = TRUE)
      df <- data.frame( Equipe = teams$Equipe[y], Note = x[y])
    #+end_src

    #+RESULTS:
    | ElPsyCongroo        | 19.5 |
    | uRhs                |   18 |
    | LEquipe21           | 16.5 |
    | SKV                 | 16.5 |
    | LesReds             | 14.5 |
    | LionsRT             | 14.5 |
    | BDM                 |   14 |
    | FioRoxPOWER         |   11 |
    | ChequeEnBois        | 10.5 |
    | ZizouTeam           | 10.5 |
    | LesNouveaux         |  9.5 |
    | TeamRocket          |    9 |
    | LesNinfomanes       |  6.5 |
    | LaTripletteGagnante |  4.5 |
    | ProjectSmiley       |  4.5 |
    | LesLegendR          |  2.5 |
    | TeamSheytan         |  2.5 |
    | +GTA+               |    0 |



** Export excel                                                    :noexport:

   #+BEGIN_SRC R :var teams=teams :results value :exports none :session part
     df <- data.frame(unlist(teams[,c("etu1", "etu2", "etu3")]), x)
     df <- df[order(df[,1]),]
   #+END_SRC

   #+RESULTS:
   | aa504011 |  4.5 |
   | aj612792 | 16.5 |
   | am501829 |  4.5 |
   | as412741 | 10.5 |
   | av502395 | 16.5 |
   | bh506742 |   14 |
   | bk506202 | 16.5 |
   | bm608749 |  9.5 |
   | bt503254 |  4.5 |
   | bt506698 | 14.5 |
   | by506127 |   14 |
   | cj503937 | 10.5 |
   | cl401373 | 10.5 |
   | cm506616 |  8.5 |
   | cs610000 | 14.5 |
   | ct502678 |    0 |
   | da400662 | 10.5 |
   | dg502433 |   14 |
   | dl500593 |  6.5 |
   | dl503057 |   18 |
   | dt411921 | 19.5 |
   | eg406896 |   14 |
   | er402540 |  4.5 |
   | fr507253 | 14.5 |
   | ga405946 |  2.5 |
   | gl504436 | 19.5 |
   | gl505046 |    0 |
   | gy507016 |   18 |
   | hc506416 |  6.5 |
   | hk608773 |  2.5 |
   | jr506436 |   11 |
   | ln501446 |  6.5 |
   | lp404690 |   18 |
   | lr513114 | 16.5 |
   | ma501325 |  4.5 |
   | ml610140 |  9.5 |
   | mm607262 |   14 |
   | mn407471 | 16.5 |
   | mo608769 |  2.5 |
   | ng407922 |    0 |
   | nm605493 |  9.5 |
   | nm609672 |  8.5 |
   | pa100963 |  2.5 |
   | pf402134 |   11 |
   | ra501649 |   14 |
   | rm505280 | 10.5 |
   | rt500892 | 19.5 |
   | rz308280 | 10.5 |
   | sb610691 |  2.5 |
   | sm308786 |  2.5 |
   | tj510287 |  4.5 |
   | va506304 |  8.5 |
   | vs502662 | 16.5 |
   | nil      |   11 |

*** v0
  #+begin_src R :var teams=teams :exports none :results output :session part 
    ##print(teams)
    ## print(sum(! is.na(teams[,c("etu1", "etu2", "etu3")])))
    x <- rowSums(teams[,c("S0", "C0", "T0", "V0")])
    x [ is.na(x) ] <- 0
    y <- rev(order( x + runif(length(x), max = 0.1) ))
    df <- data.frame( Equipe = teams$Equipe[y], NoteV0 = x[y])
    print(df)
   #+end_src
  
  #+RESULTS:
  #+begin_example
                  Equipe NoteV0
  1            LEquipe21   2.50
  2                 uRhs   2.25
  3  LaTripletteGagnante   2.25
  4                  SKV   2.25
  5                  BDM   2.00
  6              LionsRT   1.75
  7           TeamRocket   1.75
  8              LesReds   1.50
  9            ZizouTeam   1.25
  10        ElPsyCongroo   1.25
  11         FioRoxPOWER   1.00
  12       LesNinfomanes   1.00
  13        ChequeEnBois   0.75
  14         TeamSheytan   0.75
  15         LesNouveaux   0.75
  16          LesLegendR   0.50
  17                 GTA   0.00
  18       ProjectSmiley   0.00
 #+end_example




    - Copie : LaTripletteGagnante.R SKV.R (68% de similarité)
    - Cas d'un vecteur de longueur nulle en entrée.
    - Pas d'affichage
    - Uniquement une fonction 

   
    Extraction depuis la boîtes de dépôts
    #+BEGIN_SRC bash
      ## unzip submission
      find . -type f -name '*.zip' -execdir unzip {} \;
      ## find READMEs
      find . -type f -iname readme.txt -exec file {} \;
      ## Retrieve sources
      mkdir ../src
      find . -type f -name '*.R' -exec cp {} ../src/ \;
    #+END_SRC


    Compilation et Exécution des tests
    #+BEGIN_SRC R
      sourceDir <- function(path, trace = TRUE, ...) {
        for (nm in list.files(path, pattern = "[.][Rr]$")) {
          if(trace) cat(nm,":")
          source(file.path(path, nm), ...)
          if(trace) cat("\n")
        }
      }
      sourceDir('src')
    #+END_SRC
   

*** Compilation et tests
 #+BEGIN_SRC R :session eval
   candidate <- "LionsRT"
   cfile <- file.path('~', "downloads", "Projet v1", "src", paste0(candidate,".R"))
   source(cfile)

   eval(call(paste0(candidate), numeric(0)))
   eval(call(paste0(candidate), 1))
   eval(call(paste0(candidate), 1:2))
   idir <- file.path('~', "introR-UNS", "partitionDatasets")
   library(partition)
   library(partitionSolvers)

 #+END_SRC

 #+RESULTS:
 : logical(0)
 : [1] 1
 : [1] FALSE
 : [1] 1
 : [1]  TRUE FALSE

*** LPT

 #+BEGIN_SRC R :session eval
   candidates <- c(candidate, "PartLPT")

   load(file.path(idir, "S20.rdata"))
   PartRace(candidates, instances, plot.file = NA, timeout=30)

   load(file.path(idir, "M20.rdata"))
   PartRace(candidates, instances, plot.file = NA, timeout=30)

 #+END_SRC

 #+RESULTS:
 #+begin_example

 Racing methods for the selection of the best
 Copyright (C) 2003 Mauro Birattari
 This software comes with ABSOLUTELY NO WARRANTY

 Race name.....................................Partition problem 
 Number of candidates..........................................2 
 Number of available tasks...................................100 
 Max number of experiments.............................unlimited 
 Statistical test..................................Friedman test 
 Tasks seen before discarding.................................10 
 Initialization function......................................ok 
 Parallel Virtual Machine.....................................no 

     We select the best algorithm for the partition problem.
     The partition problem consists in finding a bi-partition
     of a set of integers which minimizes the difference
     between their sums. Each run has a timeout of 30 seconds. 


                             Markers:                           
                                x No test is performed.         
                                - The test is performed and     
                                  some candidates are discarded.
                                = The test is performed but     
                                  no candidate is discarded.    


 +-+-----------+-----------+-----------+-----------+-----------+
 | |       Task|      Alive|       Best|  Mean best| Exp so far|
 +-+-----------+-----------+-----------+-----------+-----------+
 |x|          1|          2|          1|  9.978e+06|          2|
 |x|          2|          2|          1|  5.168e+06|          4|
 |x|          3|          2|          1|  3.445e+06|          6|
 |x|          4|          2|          1|  5.081e+06|          8|
 |x|          5|          2|          1|  4.065e+06|         10|
 |x|          6|          2|          1|  3.389e+06|         12|
 |x|          7|          2|          1|  3.047e+06|         14|
 |x|          8|          2|          1|  2.716e+06|         16|
 |x|          9|          2|          1|  2.416e+06|         18|
 |-|         10|          1|          1|  3.034e+06|         20|
 +-+-----------+-----------+-----------+-----------+-----------+

 Selected candidate:           1	mean value:  3.034e+06

 Description of the selected candidate:
 [1] "LionsRT"


 Ranking
      name rank
 1 LionsRT    1
 2 PartLPT    2

 That's all folks !

 Racing methods for the selection of the best
 Copyright (C) 2003 Mauro Birattari
 This software comes with ABSOLUTELY NO WARRANTY

 Race name.....................................Partition problem 
 Number of candidates..........................................2 
 Number of available tasks....................................40 
 Max number of experiments.............................unlimited 
 Statistical test..................................Friedman test 
 Tasks seen before discarding.................................10 
 Initialization function......................................ok 
 Parallel Virtual Machine.....................................no 

     We select the best algorithm for the partition problem.
     The partition problem consists in finding a bi-partition
     of a set of integers which minimizes the difference
     between their sums. Each run has a timeout of 30 seconds. 


                             Markers:                           
                                x No test is performed.         
                                - The test is performed and     
                                  some candidates are discarded.
                                = The test is performed but     
                                  no candidate is discarded.    


 +-+-----------+-----------+-----------+-----------+-----------+
 | |       Task|      Alive|       Best|  Mean best| Exp so far|
 +-+-----------+-----------+-----------+-----------+-----------+
 |x|          1|          2|          1|        225|          2|
 |x|          2|          2|          1|      115.5|          4|
 |x|          3|          2|          1|        104|          6|
 |x|          4|          2|          1|         83|          8|
 |x|          5|          2|          1|       4987|         10|
 |x|          6|          2|          1|       4177|         12|
 |x|          7|          2|          1|       3582|         14|
 |x|          8|          2|          1|       3136|         16|
 |x|          9|          2|          1|       2800|         18|
 |-|         10|          1|          1|  1.257e+04|         20|
 +-+-----------+-----------+-----------+-----------+-----------+

 Selected candidate:           1	mean value:  1.257e+04

 Description of the selected candidate:
 [1] "LionsRT"


 Ranking
      name rank
 1 LionsRT    1
 2 PartLPT    2

 That's all folks !
#+end_example

 #+BEGIN_SRC R :session eval
   load(file.path(idir, "L10.rdata"))
   PartRace(candidates, instances, plot.file = NA, timeout=30)
 #+END_SRC



*** Passage à l'échelle                                            :noexport:


 #+BEGIN_SRC R
  size <- 5 
  precision <- 10
  precision * seq(size) 
  #+END_SRC

  #+RESULTS:
  : [1] 10 20 30 40 50  

     Ces instance sont "faciles", car un algorithme glouton les résout optimalement.
     L'algorithme construit une partition parfaite si n ou n+1 est un multiple de 4, sinon il construit une partition optimale dont la différence est égale à la précision. 
     Sans perte de généralité, nous supposons que la précision est égale à 1.
     L'algorithme sélectionne les colonnes paires du tableau ci-dessous.

   
     | n          |      |      |       |       |       |      |      |
     |------------+------+------+-------+-------+-------+------+------|
     | /          |    < |      |       |       |       |      |      |
     | n = 4p     |    1 |    2 | \dots | 2p-1  | 2p    |      |      |
     | (parfaite) |   4p | 4p-1 | \dots | 2p+2  | 2p+1  |      |      |
     |------------+------+------+-------+-------+-------+------+------|
     | n = 4p +1  |    1 |    2 | 3     | \dots | 2p    | 2p+1 |      |
     | (optimale) |      | 4p+1 | 4p    | \dots | 2p+3  | 2p+2 |      |
     |------------+------+------+-------+-------+-------+------+------|
     | n = 4p +2  |    1 |    2 | 3     | \dots | 2p    | 2p+1 |      |
     | (optimale) | 4p+2 | 4p+1 | 4p    | \dots | 2p+3  |      | 2p+2 |
     |------------+------+------+-------+-------+-------+------+------|
     | n = 4p + 3 |    1 |    3 | 4     | 5     | \dots | 2p+2 | 2p+3 |
     | (parfaite) |    2 |      | 4p+3  | 4p+2  | \dots | 2p+5 | 2p+4 |
** Travailler sur un vecteur trié d'entiers 

   La plupart des algorithmes offriront de meilleures performances en triant les entiers. 
 #+BEGIN_SRC R :session perm
   sizes <- c(13, 11, 8, 20, 20, 11, 16, 17, 4, 13)
   perm <- order(sizes, decreasing = TRUE)
   sortedSizes <- sizes[perm]
   print(perm)
   print(sortedSizes)
 #+END_SRC

 #+RESULTS:
 :  [1]  4  5  8  7  1 10  2  6  3  9
 :  [1] 20 20 17 16 13 13 11 11  8  4

   Ces algorithmes calculent donc une partition du vecteur trié (une permutation du vecteur original).
 #+BEGIN_SRC R :session perm
   sortedPart <- rep(c(TRUE,FALSE), each = 5)
   print(sortedPart)
   print(sortedSizes[sortedPart])
 #+END_SRC

 #+RESULTS:
 :  [1]  TRUE  TRUE  TRUE  TRUE  TRUE FALSE FALSE FALSE FALSE FALSE
 :  [1] 20 20 17 16 13

   Mais, les spécifications exigent de renvoyer une partition du vecteur non trié.
   Il faut inverser la permutation triant le vecteur.

 #+BEGIN_SRC R :session perm
   part <- logical(10)
   part[perm] <- sortedPart
   print(part)
   print(sizes[part])
 #+END_SRC

 #+RESULTS:
 :  [1]  TRUE FALSE FALSE  TRUE  TRUE FALSE  TRUE  TRUE FALSE FALSE
 :  [1] 13 20 20 16 17

